Repository: flunardelli/portaltvsl
Catalog: trunk/modules/throttle/translations/modules-throttle.*.po
Languages: pt_pt

source: Auto-throttle on anonymous users
pt_pt: Regulação de carga para utilizadores anónimos

source: The congestion control throttle can be automatically enabled when the number of anonymous users currently visiting your site exceeds the specified threshold. For example, to start the throttle when your site has 250 anonymous users online at once, enter '250' in this field. Leave this value blank or set to "0" if you do not wish to auto-throttle on anonymous users. You can inspect the current number of anonymous users using the "Who's online" block.
pt_pt: A regulação de carga pode ser automaticamente activada quando o número de utilizadores com sessão aberta visitando o seu site exceder o limite especificado. Por exemplo, para iniciar a regulação quando seu site tiver 250 utilizadores com a sessão aberta em simultâneo, introduza "50" neste campo. Deixe o valor em branco ou ajuste para "0" se não deseja utilizar a regulação nos utilizadores anónimos. Poderá verificar o número actual de utilizadores anónimos activando o bloco "Utilizadores em linha".

source: Auto-throttle on authenticated users
pt_pt: Regulação de carga para utilizadores autenticados

source: The congestion control throttle can be automatically enabled when the number of authenticated users currently visiting your site exceeds the specified threshold. For example, to start the throttle when your site has 50 registered users online at once, enter '50' in this field. Leave this value blank or set to "0" if you do not wish to auto-throttle on authenticated users. You can inspect the current number of authenticated users using the "Who's online" block.
pt_pt: A regulação de carga pode ser automaticamente activada quando o número de utilizadores autenticados visitando o seu site exceder o limite especificado. Por exemplo, para iniciar a regulação de carga quando o seu site tiver 50 utilizadores registados em simultâneo, coloque "50" neste campo. Deixe o valor em branco ou ajuste para "0" se não deseja utilizar a regulação nos utilizadores que iniciaram sessão. Poderá verificar o número actual de utilizadores com sessão aberta activando o bloco "Utilizadores em linha".

source: Auto-throttle probability limiter
pt_pt: Limitador de probabilidades da auto-regulador de carga

source: The auto-throttle probability limiter is an efficiency mechanism to statistically reduce the overhead of the auto-throttle. The limiter is expressed as a percentage of page views, so for example if set to the default of 10% we only perform the extra database queries to update the throttle status 1 out of every 10 page views. The busier your site, the lower you should set the limiter value.
pt_pt: O limitador de probabilidade da regulação de carga é um mecanismo eficiente para reduzir estatisticamente a sobrecarga do auto-regulador. O limitador é expressado como uma percentagem de visualizações de páginas, por exemplo, se fixado no valor por defeito de 10%, apenas irão ser executadas questões (<em>queries</em>) na base de dados, para actualização do regulador de carga por cada 1 em 10 visualizações de página. Quanto maior for o número de acessos ao seu site, menor deverá ser o valor do limitador.

source: %value is not a valid auto-throttle setting. Please enter a positive numeric value.
pt_pt: '%value' não é um parâmetro de regulação de carga válido. Por favor introduza um valor numérico positivo.

source: The throttle module provides a congestion control mechanism that automatically adjusts to a surge in incoming traffic. If your site is referenced by a popular website, or experiences a "Denial of Service" (DoS) attack, your webserver might become overwhelmed. The throttle mechanism is utilized by modules to temporarily disable CPU-intensive functionality, increasing performance. For instance, via the throttle module, modules may choose to disable resource-intensive blocks or the code within the site theme may temporarily disable user pictures in posts.
pt_pt: O módulo <em>throttle</em> fornece um mecanismo para controlo da congestão, o qual se ajusta automaticamente a picos de tráfego. Se o seu site for ligado por um site popular, ou se vier a ser exposto a um ataque "Negação de Serviço" (<em>Denial of Service</em> - DoS), o seu servidor poderá não conseguir lidar com o volume de visitantes. Este mecanismo é utilizado por outros módulos para desactivar temporariamente funcionalidades que recorrem intensivamente ao processador, optimizando assim o desempenho. Por exemplo, através do módulo <em>throttle</em>, outros módulos podem escolher desactivar blocos que utilizem o processador intensivamente, ou o código no tema do site pode desactivar temporariamente os <em>avatars</em> nos conteúdos.

source: The congestion control throttle can be automatically enabled when the number of anonymous or authenticated users currently visiting the site exceeds a specified threshold.
pt_pt: A regulação de carga pode ser activada automaticamente quando o número de utilizadores anónimos ou autenticados a visitar o seu site exceder o limite especificado.

source: For more information, see the online handbook entry for <a href="@throttle">Throttle module</a>.
pt_pt: Para mais informação consulte a <a href="@throttle">página do módulo Throttle</a> no manual.

source: The throttle module provides a congestion control mechanism that automatically adjusts to a surge in incoming traffic. If your site is referenced by a popular website, or experiences a "Denial of Service" (DoS) attack, your webserver might become overwhelmed. The throttle mechanism is utilized by modules to temporarily disable CPU-intensive functionality, increasing performance.
pt_pt: O módulo <em>throttle</em> fornece um mecanismo para controlo da congestão, o qual se ajusta automaticamente a picos de tráfego. Se o seu site for ligado por um site popular, ou se vier a ser exposto a um ataque "Negação de Serviço" (<em>Denial of Service</em> - DoS), o seu servidor poderá não conseguir lidar com o volume de visitantes. Este mecanismo é utilizado por outros módulos para desactivar temporariamente funcionalidades que recorrem intensivamente ao processador, optimizando assim o desempenho.

source: throttle
pt_pt: regulador de carga

source: 1 user accessing site; throttle enabled.
pt_pt: 1 utilizador acedendo ao site; regulação de carga activada.

source: 1 guest accessing site; throttle enabled.
pt_pt: 1 convidado acedendo ao site; regulação de carga activada.

source: 1 guest accessing site; throttle disabled
pt_pt: 1 convidado acedendo ao site; regulação de carga desactivada.

source: Control how your site cuts out content during heavy load.
pt_pt: Controlar como o seu site gere os conteúdos quando estiver congestionado.
