Repository: flunardelli/portaltvsl
Catalog: trunk/modules/dblog/translations/modules-dblog.*.po
Languages: pt_pt

source: Discard log entries above the following row limit
pt_pt: Descartar as entradas no histórico acima do seguinte limite de linhas

source: The maximum number of rows to keep in the database log. Older entries will be automatically discarded. (Requires a correctly configured <a href="@cron">cron maintenance task</a>.)
pt_pt: O número máximo de linhas a guardar no histórico. Entradas mais antigas serão automaticamente descartadas. (Requere uma <a href="@cron">tarefa de manutenção no cron</a> correctamente configurada.)

source: No log messages available.
pt_pt: Não há mensagens no histórico.

source: Count
pt_pt: Contagem

source: Location
pt_pt: Localização

source: Severity
pt_pt: Severidade

source: Filter log messages
pt_pt: FIltrar mensagens no histórico

source: You must select something to filter by.
pt_pt: É obrigatório seleccionar algo para filtrar.

source: The dblog module monitors your system, capturing system events in a log to be reviewed by an authorized individual at a later time. This is useful for site administrators who want a quick overview of activities on their site. The logs also record the sequence of events, so it can be useful for debugging site errors.
pt_pt: O módulo <em>dblog</em> observa o sistema, capturando eventos do sistema no histórico por forma a que possam ser revistos posteriormente por pessoas autorizadas. É útil para administradores que pretendem uma visão rápida sobre as actividades que ocorrem no site. O histórico também regista a sequência de eventos, sendo útil para depurar erros no site.

source: The dblog log is simply a list of recorded events containing usage data, performance data, errors, warnings and operational information. Administrators should check the dblog report on a regular basis to ensure their site is working properly.
pt_pt: O <em>dblog</em> é apenas uma lista de eventos registados contendo dados, dados de desempenho, erros, avisos e informação operacional. Os administradores devem verificar regularmente o relatório do <em>dblog</em> para assegurar que o seu site está a trabalhar correctamente.

source: For more information, see the online handbook entry for <a href="@dblog">Dblog module</a>.
pt_pt: Para mais informação consulte a entrada do <a href="@dblog">módulo <em>Dblog</em></a> no manual de configuração online.

source: The dblog module monitors your website, capturing system events in a log to be reviewed by an authorized individual at a later time. The dblog log is simply a list of recorded events containing usage data, performance data, errors, warnings and operational information. It is vital to check the dblog report on a regular basis as it is often the only way to tell what is going on.
pt_pt: O módulo <em>dblog</em> observa o sistema, capturando eventos do sistema no histórico por forma a que possam ser revistos posteriormente por pessoas autorizadas. O <em>dblog</em> é apenas uma lista de eventos registados contendo dados, dados de desempenho, erros, avisos e informação operacional. É vital verificar o relatório do <em>dblog</em> regularmente, porque é a única forma de saber o que está acontecer no site.

source: Settings for logging to the Drupal database logs. This is the most common method for small to medium sites on shared hosting. The logs are viewable from the admin pages.
pt_pt: Configurações para registar na base de dados de histórico do Drupal. Este é o método mais comum para sites pequenos e médios em alojamento partilhado. Os históricos são consultados a partir das páginas de administração.

source: Recent log entries
pt_pt: Entradas recentes no histórico

source: View events that have recently been logged.
pt_pt: Visualizar eventos registados recentemente.

source: Top 'page not found' errors
pt_pt: Top de erros de 'página não encontrada'

source: View 'page not found' errors (404s).
pt_pt: Visualizar erros 'página não encontrada' (404).

source: Top 'access denied' errors
pt_pt: Top de erros 'acesso negado'

source: View 'access denied' errors (403s).
pt_pt: Visualizar erros 'acesso negado' (403).

source: Table that contains logs of all system events.
pt_pt: Tabela que contém os históricos de todos os eventos do sistema.

source: Primary Key: Unique watchdog event ID.
pt_pt: Chave primária: ID único do evento watchdog.

source: The {users}.uid of the user who triggered the event.
pt_pt: O {users}.uid do utilizador que activou o evento.

source: Type of log message, for example "user" or "page not found."
pt_pt: Tipo de mensagem, por exemplo "utilizador" ou "página não encontrada."

source: Text of log message to be passed into the t() function.
pt_pt: Texto da mensagem a ser passado à função t().

source: Serialized array of variables that match the message string and that is passed into the t() function.
pt_pt: Array serializado contendo as variáveis que combinam com o texto da mensagem e que são passadas à função t().

source: The severity level of the event; ranges from 0 (Emergency) to 7 (Debug)
pt_pt: O nível de severidade do evento; entre 0 (Emergência) e 7 (Depuração)

source: Link to view the result of the event.
pt_pt: Ligação para visualizar o resultado do evento.

source: URL of the origin of the event.
pt_pt: URL da origem do evento.

source: URL of referring page.
pt_pt: URL da página referente.

source: Hostname of the user who triggered the event.
pt_pt: O nome da máquina do utilizador que activou o evento.

source: Unix timestamp of when event occurred.
pt_pt: Unix timestamp de quando ocorreu o evento.
